{
  "backend/main.mo": "Main Motoko actor implementing user profiles, page content management, pricing entries, access control with role-based permissions, and blob storage mixin functionality.",
  "feature_evidence.json": "Feature evidence report documenting a single feature that changes a section title on the Swiss Online Couples Landing Page to match Basel page structure.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including pages, components, hooks, and configuration, describing SEO optimization, mobile-responsive design, and German-language content for a couples coaching website.",
  "frontend/ic-assets.json": "Internet Computer asset configuration that explicitly includes the .well-known directory for domain verification.",
  "frontend/index.html": "HTML entry point with German language, SEO meta tags for online couples coaching, and Plausible Analytics tracking for www.paarweg.com.",
  "frontend/public/.well-known/ic-domains": "Domain verification file listing paarweg.com and www.paarweg.com for Internet Computer custom domain configuration.",
  "frontend/public/sitemap.xml": "XML sitemap listing all public pages including homepage, service pages, legal pages, and three landing pages (Zurich, Basel, Swiss Online) with priorities and last modified dates.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with all routes including three landing pages, wrapping the app with ThemeProvider, QueryClientProvider, and Toaster.",
  "frontend/src/components/admin/ThemeHexCodesSection.tsx": "Admin UI component that displays runtime-computed HEX color values for page background and primary button, with copy-to-clipboard functionality for each color.",
  "frontend/src/components/CalendlyInlineWidget.tsx": "Empty component file for Calendly widget integration (currently unused).",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header navigation, mobile hamburger menu, instant scroll-to-top on route changes, and footer displaying Basel headquarters with UTM-tracked attribution.",
  "frontend/src/components/MobileReadMore.tsx": "Reusable component that collapses content on mobile with expand/collapse toggle button, gradient fade effect, and feature flag to disable compacting for SEO purposes.",
  "frontend/src/config/featureFlags.ts": "Centralized feature flags configuration, currently containing a single flag to control mobile \"Read more/Show less\" compacting behavior (default: disabled).",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor with Internet Identity authentication, automatically invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCalendlyScript.ts": "Empty file with no content.",
  "frontend/src/hooks/useComputedThemeHexColors.ts": "Hook that derives HEX color values at runtime by reading computed styles from probe elements, re-computing when theme changes (e.g., dark mode toggle).",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for CSR (Certificate Signing Request) operations, including hardcoded metadata retrieval and PKCS#10 CSR generation using Web Crypto API with RSA-2048 keys.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm sand/beige color palette for light and dark modes, plus base styling for text rendering and mobile responsiveness.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AboutPage.tsx": "About page for Roland Soder showcasing his credentials as a certified systemic coach, his approach to couples coaching, and his background. Includes SEO metadata, hero section with image, values/approach sections, and CTA for booking.",
  "frontend/src/pages/BaselCouplesLandingPage.tsx": "Location-specific landing page targeting couples in Basel for online couples counseling. Features hero section with image, benefits, process steps, testimonials, and CTAs for booking consultations.",
  "frontend/src/pages/ContactPage.tsx": "Contact page with direct contact information (email, phone), Calendly booking integration, and FAQ accordion. Includes SEO metadata and details about initial consultation pricing (60 CHF for 60 minutes).",
  "frontend/src/pages/CouplesPage.tsx": "Main couples coaching service page explaining the coaching approach for couples in all relationship phases. Features hero section, service benefits, process overview, and mobile-optimized collapsible content sections.",
  "frontend/src/pages/CSRGeneratorPage.tsx": "Administrative page for generating SSL Certificate Signing Requests (CSR) with auto-generation on load. Displays CSR and public key with copy/download functionality, DNS warnings, and detailed setup instructions.",
  "frontend/src/pages/DomainVerificationPage.tsx": "React page that checks and displays the status of the Internet Computer domain verification file at /.well-known/ic-domains, verifying it contains 'www.paarweg.com'.",
  "frontend/src/pages/HomePage.tsx": "Main landing page for PaarWeg coaching service featuring hero section, service cards, and comprehensive SEO meta tags including Open Graph, Twitter Cards, and JSON-LD structured data.",
  "frontend/src/pages/LegalPage.tsx": "Legal information page displaying Impressum (imprint) and privacy policy for Roland Soder Coaching in Switzerland, including contact details, liability disclaimers, and copyright information.",
  "frontend/src/pages/MenPage.tsx": "Dedicated coaching page targeting men in relationships, featuring hero section with collapsible content and SEO optimization for relationship coaching services.",
  "frontend/src/pages/PricingPage.tsx": "Pricing page displaying coaching session costs (60 CHF for initial consultation, 190 CHF for 90-min sessions) with FAQ accordion and comprehensive SEO meta tags.",
  "frontend/src/pages/SitemapPage.tsx": "Human-readable sitemap page that displays XML sitemap structure with all public URLs, priorities, and change frequencies for search engine submission.",
  "frontend/src/pages/SwissOnlineCouplesLandingPage.tsx": "Landing page for Swiss online couples counseling with SEO metadata, structured data, hero section, and service information targeting communication problems in relationships.",
  "frontend/src/pages/TechnicalStatusPage.tsx": "Admin page displaying technical health checks including DNS configuration, SSL certificates, redirects, analytics integration, and domain resolution with real-time status indicators.",
  "frontend/src/pages/WomenPage.tsx": "Marketing page for women's relationship coaching with SEO optimization, hero section, and collapsible content addressing emotional exhaustion and relationship needs.",
  "frontend/src/pages/ZurichCouplesLandingPage.tsx": "Zurich-specific couples counseling landing page with localized SEO metadata, hero section with image, and call-to-action for online relationship coaching services.",
  "frontend/src/types/calendly.d.ts": "TypeScript declaration file for Calendly integration types (file appears empty or minimal).",
  "frontend/src/utils/color.ts": "Utility functions for converting CSS color formats (rgb, rgba, oklch) to HEX format, including OKLCH to RGB color space conversion with proper gamma correction.",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing utilities supporting both query strings and hash-based routing, with sessionStorage persistence for maintaining state like admin tokens across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including OKLCH color system with CSS variables, container settings, border radius utilities, custom animations for accordions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file for PaarWeg online couples counseling platform tracking a feature request to update section title from 'So läuft PaarWeg ab' to 'So funktioniert Online-Paarberatung bei PaarWeg' on the Switzerland page to match Basel page structure."
}