{
  "backend/main.mo": "Main Motoko actor implementing user profiles, page content management, pricing entries, access control with role-based permissions, and blob storage mixin integration.",
  "feature_evidence.json": "Feature evidence report documenting two completed features for updating Basel couples landing page layout and adding hero image to match Zürich couples landing page.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including pages, components, hooks, and configuration with details on SEO, mobile optimization, and functionality.",
  "frontend/ic-assets.json": "IC assets configuration specifying that .well-known directory should not be ignored during asset deployment.",
  "frontend/index.html": "HTML entry point with German language, SEO meta tags for online couples coaching, and Plausible Analytics tracking for www.paarweg.com.",
  "frontend/public/.well-known/ic-domains": "Domain verification file listing paarweg.com and www.paarweg.com as authorized domains for Internet Computer hosting.",
  "frontend/public/sitemap.xml": "XML sitemap listing all public pages including home, service pages, legal pages, and two landing pages (Zurich and Basel) with priorities and update frequencies.",
  "frontend/src/App.tsx": "Main React app with TanStack Router configuration defining all routes including Basel and Zurich landing pages, wrapped with ThemeProvider, QueryClientProvider, and Toaster.",
  "frontend/src/components/admin/ThemeHexCodesSection.tsx": "Admin UI component that displays runtime-computed HEX color values for page background and primary button, with copy-to-clipboard functionality for each color.",
  "frontend/src/components/CalendlyInlineWidget.tsx": "Empty component file for Calendly widget integration (currently unused).",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header, desktop/mobile navigation, logo, mobile sheet menu, footer with Basel headquarters info and caffeine.ai attribution, and instant scroll-to-top on route changes.",
  "frontend/src/components/MobileReadMore.tsx": "Reusable component providing collapsible content sections on mobile with expand/collapse buttons and gradient fade effect, controlled by feature flag for compacting behavior.",
  "frontend/src/config/featureFlags.ts": "Centralized feature flags configuration, currently containing a single flag to enable/disable mobile \"Read more / Show less\" compacting behavior (default: false).",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor with authentication, automatically recreating it when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useCalendlyScript.ts": "Empty file with no content.",
  "frontend/src/hooks/useComputedThemeHexColors.ts": "React hook that derives HEX color values at runtime by reading computed styles from probe elements, re-computing when theme changes (e.g., dark mode toggle).",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, managing login/logout flow, identity persistence, and auth client lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for CSR (Certificate Signing Request) operations, including fetching hardcoded metadata for paarweg.com and generating PKCS#10 compliant CSRs using Web Crypto API.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm sand/beige color palette for light and dark modes, including theme colors, chart colors, and sidebar styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AboutPage.tsx": "About page for Roland Soder showcasing his coaching credentials, philosophy, and approach. Sets SEO metadata, displays hero section with image, values, approach cards, and CTA for booking.",
  "frontend/src/pages/BaselCouplesLandingPage.tsx": "Location-specific landing page for Basel couples counseling services. Features hero section with image, service benefits, process steps, and booking CTAs with SEO optimization for Basel region.",
  "frontend/src/pages/ContactPage.tsx": "Contact page with multiple contact methods (email, phone, Calendly booking), pricing information for initial consultation, and FAQ accordion. Includes SEO metadata and structured contact cards.",
  "frontend/src/pages/CouplesPage.tsx": "Main couples coaching service page explaining the coaching approach for relationships in various stages. Features hero section, mobile-friendly read-more component, and booking CTA with comprehensive SEO setup.",
  "frontend/src/pages/CSRGeneratorPage.tsx": "Administrative page for generating SSL Certificate Signing Requests (CSR). Auto-generates CSR on load, displays CSR and public key with copy/download functionality, and checks DNS forwarding status.",
  "frontend/src/pages/DomainVerificationPage.tsx": "React page that checks and displays the verification status of the Internet Computer domain configuration file at /.well-known/ic-domains, expecting it to contain 'www.paarweg.com'.",
  "frontend/src/pages/HomePage.tsx": "Main landing page for PaarWeg coaching service featuring hero section, service cards, and comprehensive SEO meta tags including Open Graph, Twitter Cards, and JSON-LD structured data for local business.",
  "frontend/src/pages/LegalPage.tsx": "Legal information page displaying Impressum (imprint) and privacy policy with contact details, liability disclaimers, and copyright information for Roland Soder Coaching in Basel, Switzerland.",
  "frontend/src/pages/MenPage.tsx": "Dedicated coaching page for men in relationships, featuring hero section with emotional messaging about relationship challenges and includes SEO optimization with meta tags and Open Graph data.",
  "frontend/src/pages/PricingPage.tsx": "Pricing page displaying coaching session costs (60 CHF for initial consultation, 190 CHF for 90-min sessions) with FAQ accordion and comprehensive SEO meta tags for search optimization.",
  "frontend/src/pages/SitemapPage.tsx": "Human-readable sitemap page that displays an XML sitemap structure with all public URLs, their priorities, and change frequencies for search engine submission.",
  "frontend/src/pages/TechnicalStatusPage.tsx": "Admin page that runs automated checks for DNS configuration, SSL certificates, redirects, analytics integration, and domain resolution, displaying status results with icons and details.",
  "frontend/src/pages/WomenPage.tsx": "Marketing landing page targeting women in relationships, featuring hero section, benefits, coaching approach, and CTA buttons with SEO metadata and Open Graph tags.",
  "frontend/src/pages/ZurichCouplesLandingPage.tsx": "Location-specific landing page for Zurich couples therapy, featuring hero section with image, benefits, and booking CTAs with comprehensive SEO and Open Graph metadata.",
  "frontend/src/types/calendly.d.ts": "Empty TypeScript declaration file, likely intended for Calendly integration type definitions.",
  "frontend/src/utils/color.ts": "Utility functions for converting CSS color formats (rgb, rgba, oklch) to HEX format, including OKLCH to RGB conversion with proper color space transformations.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and persisting URL parameters from both query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, extended theme tokens for UI components (sidebar, chart, card, etc.), and animation utilities.",
  "project_state.json": "Project state file for PaarWeg landing page with location-specific pages for Basel and Zürich. Tracks two completed features for updating Basel page layout and hero image to match Zürich page, with one pending feature request."
}