{
  "backend/main.mo": "Actor providing access control, user profiles, page content, pricing entries, and CSR info with Map-based storage and permission checks.",
  "feature_evidence.json": "Feature evidence report linking a theme color display feature to its related files, components, and test references.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of various frontend files for documentation or build planning.",
  "frontend/ic-assets.json": "Specifies asset rules for deployment, ensuring '.well-known' files are included.",
  "frontend/index.html": "Main HTML entry file with German metadata, SEO description, and Plausible Analytics script.",
  "frontend/public/.well-known/ic-domains": "Lists verified domains for Internet Computer canister configuration.",
  "frontend/public/sitemap.xml": "XML sitemap defining URLs, priorities, and update frequencies for the site's pages.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, React Query client, theming, and application-level providers.",
  "frontend/src/components/admin/ThemeHexCodesSection.tsx": "Admin UI component showing computed theme HEX colors with copy-to-clipboard support.",
  "frontend/src/components/CalendlyInlineWidget.tsx": "Reusable component that loads and renders an inline Calendly booking widget.",
  "frontend/src/components/Layout.tsx": "Global layout with header navigation, mobile menu, scroll-to-top behavior, and reload logic for the contact page.",
  "frontend/src/components/MobileReadMore.tsx": "Component providing collapsible mobile-only content with toggle controls and optional feature flag behavior.",
  "frontend/src/config/featureFlags.ts": "Defines app-wide feature flags such as mobile read‑more behavior.",
  "frontend/src/hooks/useActor.ts": "Creates and manages authenticated or anonymous backend actors, refreshing queries when identity changes.",
  "frontend/src/hooks/useCalendlyScript.ts": "Ensures the Calendly widget script loads once and reports readiness.",
  "frontend/src/hooks/useComputedThemeHexColors.ts": "Computes theme HEX colors at runtime by probing DOM styles and recalculates on theme changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, status, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching CSR metadata and generating new CSRs in the browser.",
  "frontend/src/index.css": "Defines Tailwind base styles and theme color variables for light and dark modes.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, and Internet Identity provider.",
  "frontend/src/pages/AboutPage.tsx": "Sets SEO metadata and renders an about page with biography text and a hero image.",
  "frontend/src/pages/ContactPage.tsx": "Configures SEO tags and renders a contact page with direct contact options and a Calendly booking widget.",
  "frontend/src/pages/CouplesPage.tsx": "Sets SEO metadata and presents information and booking options for couples coaching services.",
  "frontend/src/pages/CSRGeneratorPage.tsx": "Generates, displays, copies, and downloads CSR data with metadata loading and DNS checks.",
  "frontend/src/pages/DomainVerificationPage.tsx": "Fetches and validates the domain verification file and displays success or error status.",
  "frontend/src/pages/HomePage.tsx": "Sets SEO metadata, structured data, and renders the homepage with hero content and service highlights.",
  "frontend/src/pages/LegalPage.tsx": "Displays the legal notices and privacy information with structured sections and styled cards.",
  "frontend/src/pages/MenPage.tsx": "Configures metadata for the men's coaching page and renders hero text with detailed coaching descriptions.",
  "frontend/src/pages/PricingPage.tsx": "Defines pricing information, SEO tags, and an FAQ section for coaching services.",
  "frontend/src/pages/SitemapPage.tsx": "Generates and displays an XML sitemap with metadata and a list of public site URLs.",
  "frontend/src/pages/TechnicalStatusPage.tsx": "Runs diagnostic checks for DNS, SSL, redirects, and analytics, showing results in a technical status dashboard.",
  "frontend/src/pages/WomenPage.tsx": "React page for women’s coaching with hero content and SEO metadata setup.",
  "frontend/src/pages/ZurichCouplesLandingPage.tsx": "Landing page for Zurich couples counseling with SEO tags and a call-to-action layout.",
  "frontend/src/types/calendly.d.ts": "TypeScript declarations for Calendly widget functions on the Window object.",
  "frontend/src/utils/color.ts": "Utilities for converting CSS color formats to HEX, including rgb, rgba, and oklch.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters and session values.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, layout, animations, and plugins.",
  "project_state.json": "Metadata file describing project state, features, and version information."
}