{
  "backend/main.mo": "Actor manages user profiles, page content, pricing entries, CSR info, and access control with role-based permissions.",
  "feature_evidence.json": "Feature evidence report describing a Zurich couples landing page text change and its related files and components.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries for key frontend files covering routing, pages, styling, and CSR generation.",
  "frontend/ic-assets.json": "Asset configuration allowing inclusion of the .well-known directory.",
  "frontend/index.html": "Main HTML entry point with SEO metadata, Plausible script, and root div for React app.",
  "frontend/public/.well-known/ic-domains": "Domain verification file listing paarweg.com and www.paarweg.com.",
  "frontend/public/sitemap.xml": "XML sitemap listing all site URLs with their metadata and last modified dates.",
  "frontend/src/App.tsx": "Sets up TanStack Router, QueryClient, theming, and all site routes including Zurich landing page.",
  "frontend/src/components/Layout.tsx": "Layout component providing header navigation, mobile menu, scroll-to-top behavior, and footer.",
  "frontend/src/components/MobileReadMore.tsx": "Collapsible mobile content component controlled by a feature flag with expand/collapse behavior.",
  "frontend/src/config/featureFlags.ts": "Defines feature flags, currently enabling or disabling mobile content compacting.",
  "frontend/src/hooks/useActor.ts": "React hook creating and managing authenticated or anonymous backend actors with automatic refetching.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login, identity loading, and status handling. Wraps AuthClient creation with custom options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks to fetch hardcoded CSR metadata and generate a new CSR using Web Crypto, including ASN.1 PKCS#10 construction.",
  "frontend/src/index.css": "Tailwind-based global styles defining light and dark theme variables with warm color palettes and basic typography and layout rules.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it in React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with SEO metadata setup and a styled hero section introducing Roland Soder.",
  "frontend/src/pages/ContactPage.tsx": "React page that sets SEO metadata and renders a contact and booking section with email, phone, and scheduling details.",
  "frontend/src/pages/CouplesPage.tsx": "Page defining SEO tags and presenting information about couples coaching with a hero section, descriptions, and a booking button.",
  "frontend/src/pages/CSRGeneratorPage.tsx": "Implements a CSR generator UI that auto-creates CSRs, checks DNS availability, and supports copying and downloading generated keys.",
  "frontend/src/pages/DomainVerificationPage.tsx": "Component that fetches and validates a domain verification file and displays success or error status with file details.",
  "frontend/src/pages/HomePage.tsx": "Homepage that configures extensive SEO metadata and presents service highlights, coaching info, and structured data.",
  "frontend/src/pages/LegalPage.tsx": "Static page displaying the site's legal information, including impressum, contact details, and disclaimers.",
  "frontend/src/pages/MenPage.tsx": "React page for men’s coaching with SEO meta tag setup and a hero section using MobileReadMore and CTA buttons.",
  "frontend/src/pages/PricingPage.tsx": "Pricing page that configures SEO tags and displays service costs, FAQs, and booking options.",
  "frontend/src/pages/SitemapPage.tsx": "Generates and displays an XML sitemap with dynamic lastmod dates and a list of public URLs.",
  "frontend/src/pages/TechnicalStatusPage.tsx": "Diagnostics page running frontend-based technical checks like DNS, SSL, redirects, and analytics integration.",
  "frontend/src/pages/WomenPage.tsx": "React page for women’s coaching with SEO setup, descriptive hero content, and CTA buttons.",
  "frontend/src/pages/ZurichCouplesLandingPage.tsx": "Landing page for Zurich couples counseling with extensive SEO tags, hero content, and booking links.",
  "frontend/src/types/calendly.d.ts": "Empty TypeScript declaration file for Calendly-related types.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters (including hash routes), storing them in sessionStorage, and clearing them, with precedence for URL values.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, container settings, animations, and plugins including typography, container queries, and animation utilities.",
  "project_state.json": "Stores project metadata including state version, summaries, features, new requests, and project configuration for tracking changes."
}