{
  "backend/main.mo": "Actor handling access control, user profiles, page content, pricing entries, and CSR info with permission checks.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file providing high-level summaries of various frontend source files.",
  "frontend/ic-assets.json": "Asset config specifying inclusion of the .well-known directory.",
  "frontend/index.html": "HTML entry point with German SEO metadata, Plausible analytics, and root mount point.",
  "frontend/public/.well-known/ic-domains": "Domain verification file listing allowed domains for Internet Computer configuration.",
  "frontend/public/sitemap.xml": "Sitemap listing all site URLs with metadata including the new Zurich landing page.",
  "frontend/src/App.tsx": "Main app file configuring TanStack Router routes including the hidden Zurich landing page.",
  "frontend/src/components/Layout.tsx": "Layout component with header, navigation excluding the Zurich page, mobile menu, and footer.",
  "frontend/src/components/MobileReadMore.tsx": "Collapsible mobile content component controlled by feature flags for compacting behavior.",
  "frontend/src/config/featureFlags.ts": "Feature flag definitions controlling optional behaviors like mobile read-more compacting.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user's Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and loading stored identities.",
  "frontend/src/hooks/useQueries.ts": "Defines hooks for fetching CSR metadata and generating a new CSR using Web Crypto, including ASN.1 construction and PEM output.",
  "frontend/src/index.css": "Tailwind CSS setup with custom color variables, light/dark mode themes, and global styling rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers before rendering the main App component.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page for Roland Soder and sets SEO metadata such as title, description, canonical link, and Open Graph tags.",
  "frontend/src/pages/ContactPage.tsx": "Renders the contact and booking page with hero text, contact options, and SEO metadata setup.",
  "frontend/src/pages/CouplesPage.tsx": "Displays the couples coaching page with hero section, expandable info, booking button, and SEO metadata.",
  "frontend/src/pages/CSRGeneratorPage.tsx": "Provides a UI to auto-generate, display, copy, and download CSRs and public keys, with DNS checks and toast notifications.",
  "frontend/src/pages/DomainVerificationPage.tsx": "Fetches and verifies the IC domain configuration file and displays the verification status and file details.",
  "frontend/src/pages/HomePage.tsx": "Implements the homepage with hero content, structured data, and extensive SEO and social metadata injection.",
  "frontend/src/pages/LegalPage.tsx": "Shows the legal information page including impressum, contact details, and liability/disclaimer sections.",
  "frontend/src/pages/MenPage.tsx": "React page for men's relationship coaching with SEO meta tags, hero content, and call-to-action elements.",
  "frontend/src/pages/PricingPage.tsx": "Pricing page defining metadata, FAQs, and pricing details for coaching services with SEO and structured UI components.",
  "frontend/src/pages/SitemapPage.tsx": "Renders a human-readable XML sitemap page using predefined URLs, metadata, and dynamic last-modified dates.",
  "frontend/src/pages/TechnicalStatusPage.tsx": "Runs client-side technical checks (DNS, SSL, redirects, analytics, domain resolution) and displays diagnostic results.",
  "frontend/src/pages/WomenPage.tsx": "React page for women's relationship coaching with SEO setup, hero text, and call-to-action buttons.",
  "frontend/src/pages/ZurichCouplesLandingPage.tsx": "Landing page targeting Zürich couples with SEO metadata, hero content, and sections describing benefits of online coaching.",
  "frontend/src/types/calendly.d.ts": "Empty TypeScript declaration file reserved for Calendly-related type definitions.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters (including hash routing), persisting them in sessionStorage, and clearing them from URL or storage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, and container settings, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Defines project state, requirements, and features for creating an unlinked Zurich-focused landing page with SEO, CTA, and routing details."
}