{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Align Basel landing page layout with Zürich page and add entry image",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Update the Basel couples landing page layout structure to match the Zürich couples landing page layout, including section arrangement, spacing, and content hierarchy",
      "acceptanceCriteria": [
        "Basel page (BaselCouplesLandingPage.tsx) uses the same section structure as Zürich page (ZurichCouplesLandingPage.tsx)",
        "Content sections appear in the same order on both pages",
        "Spacing and padding between sections matches Zürich page"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/BaselCouplesLandingPage.tsx",
          "operation": "modify",
          "description": "Restructure the page layout to match ZurichCouplesLandingPage.tsx structure. Add hero section with image container matching Zürich's layout, ensure consistent section ordering (hero, service description, call-to-action sections), apply matching spacing classes and container structure. Preserve all Basel-specific content text and SEO metadata including Open Graph tags. Maintain mobile responsiveness."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add an entry/hero image to the Basel couples landing page matching the visual presentation of the Zürich couples landing page hero section",
      "acceptanceCriteria": [
        "Basel page displays a hero image in the same position and style as the Zürich page",
        "Image is properly responsive and mobile-optimized",
        "Image loads from frontend/public/assets/generated directory"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/BaselCouplesLandingPage.tsx",
          "operation": "modify",
          "description": "Add hero image integration using the generated image at frontend/public/assets/generated/basel-hero.dim_1200x600.jpg. Implement the image with the same responsive styling, positioning, and container structure as used in ZurichCouplesLandingPage.tsx. Ensure proper mobile optimization with appropriate image sizing and loading attributes. The image should be integrated into the hero section created in REQ-1."
        }
      ]
    }
  ]
}